var data = [];
var dataStr = '1、肖申克的救赎<br>\
<br>\
希望让人自由<br>\
20世纪40年代末，小有成就的青年银行家安迪（蒂姆·罗宾斯 Tim Robbins 饰）因涉嫌杀害妻子及她的情人而锒铛入狱。在这座名为肖申克的监狱内，希望似乎虚无缥缈<br>\
<br>\
<br>\
2、阿甘正传<br>\
<br>\
一部美国近现代史<br>\
阿甘（汤姆·汉克斯 饰）于二战结束后不久出生在美国南方阿拉巴马州一个闭塞的小镇，他先天弱智，智商只有75，然而他的妈妈是一个性格坚强的女性，她常常鼓励阿甘“傻人有傻福”，要他自强不息。<br>\
<br>\
<br>\
3、海上钢琴师<br>\
<br>\
每个人都要走一条自己坚定了的路，就算是粉身碎骨。<br>\
1900年，Virginian号豪华邮轮上，一个孤儿被遗弃在头等舱，由船上的水手抚养长大，取名1900（蒂姆•罗斯 饰）。1900慢慢长大，显示出了无师自通的非凡钢琴天赋，在船上的乐队表演钢琴，每个听过他演奏的人，都被深深打动。<br>\
<br>\
<br>\
4、中国合伙人<br>\
<br>\
·不要跟丈母娘打麻将，不要跟想法比你多的女人上床，不要跟最好的朋友合伙开公司。<br>\
·梦想是什么，梦想就是一种让你感到坚持就是幸福的东西。<br>\
·当才华撑不起野心的时候，只能安静读书。<br>\
·最大的骗子其实是我们自己，因为我们总是想改变别人，而拒绝改变自己。<br>\
·你知道吗 听一个人说话，不要听他说了什么，而是要听他没说什么。<br>\
<br>\
<br>\
5、机器人总动员<br>\
<br>\
小瓦力，大人生。<br>\
公元2805年，人类文明高度发展，却因污染和生活垃圾大量增加使得地球不再适于人类居住。地球人被迫乘坐飞船离开故乡，进行一次漫长无边的宇宙之旅。临行前他们委托Buynlarge的公司对地球垃圾进行清理，该公司开发了名为WALL·E（Waste Allocation Loa d Lifters – Earth 地球废品分装员）的机器人担当此重任。<br>\
<br>\
<br>\
6、后会无期<br>\
<br>\
·我们听过无数的道理，却仍旧过不好这一生。<br>\
·喜欢就会放肆，但爱就是克制。<br>\
·每一次告别，最好用力一点。多说一句，可能是最后一句。多看一眼，可能是最后一眼。<br>\
·有时候，你想证明给一万个人看，到后来，你发现只得到了一个明白的人，那就够了。<br>\
·带不走的留不下，留不下的莫牵挂。<br>\
·她们都是你漫漫长路上，只配错过的好姑娘。<br>\
<br>\
<br>\
7、触不可及<br>\
<br>\
满满温情的高雅喜剧。<br>\
因为一次跳伞事故，白人富翁菲利普Philippe（弗朗索瓦·克鲁塞 François Cluzet 饰）瘫痪在床，欲招聘一名全职陪护。由于薪酬高，应聘者云集，个个舌灿莲花，却无法打动他的心。直到黑人德希斯Driss（奥玛·赛 Omar Sy 饰）的出现才让他作出决定。<br>\
<br>\
<br>\
8、少年派的奇幻漂流<br>\
<br>\
瑰丽壮观、无人能及的冒险之旅。<br>\
故事开始于蒙特娄，也结束于蒙特娄。一名在找寻灵感的作家（拉菲·斯波 Rafe Spall 饰）无意间得知派·帕帖尔（伊尔凡·可汗 Irrfan Khan 饰）的传奇故事。派的父亲（阿迪勒·侯赛因 Adil Hussain 饰）开了一家动物园。因这样特殊的生活环境<br>\
<br>\
<br>\
9、星际穿越<br>\
<br>\
爱是一种力量，让我们超越时空感知它的存在。<br>\
近未来的地球黄沙遍野，小麦、秋葵等基础农作物相继因枯萎病灭绝，人类不再像从前那样仰望星空，放纵想象力和灵感的迸发，而是每日在沙尘暴的肆虐下倒数着所剩不多的光景。在家务农的前NASA宇航员库珀（马修·麦康纳 Matthew McConaughey 饰）接连在女儿墨菲<br>\
<br>\
<br>\
10、灰姑娘<br>\
<br>\
·每个女孩，心中都有一只水晶鞋。<br>\
·Kindness is free. Love is free. 善良和爱都是免费的。<br>\
·Where there is kindness, there is goodness.And where there is goodness, there is magic. <br>\
·有善良之处即有美德，有美德之处即有魔力。<br>\
<br>\
<br>\
11、千与千寻<br>\
<br>\
·人生就是一列开往坟墓的列车，路途上会有很多站，很难有人可以自始至终陪着走完。当陪你的人要下车时，即使不舍也该心存感激，然后挥手道别。<br>\
·曾经发生过的事情不可能忘记，只不过是想不起而已。<br>\
·人永远不知道，谁哪次不经意的跟你说了再见之后，就真的不会再见了。<br>\
·我只能送你到这里了，剩下的路你要自己走，不要回头。<br>\
<br>\
<br>\
12、哆啦A梦：伴我同行<br>\
<br>\
·我一直在，守着你的天真和笑容。<br>\
·你总是这样轻言放弃的话，无论多久都只会原地踏步。<br>\
·一开始做不到的事就别吹牛啊！总是依靠我依靠我怎么行啊！偶尔也自己努力一下试试啊！<br>\
·每个人都有自己的任务，任务完成了，就离开吧。<br>\
·大雄：“我不想长高” 多啦A梦：“为什么” 大雄：“因为我长高了哆啦A梦就不能牵到我的手了”<br>\
<br>\
<br>\
13、冰雪奇缘<br>\
<br>\
·爱就是把某个人看得比你自己重要。<br>\
·你必须先结束一段不对的感情，才能发现那个最适合你的人。<br>\
·解救冰封的心，只能靠一个发自真爱的行动。<br>\
·做个好女孩，就像你从前一样。<br>\
<br>\
<br>\
14、超能陆战队<br>\
<br>\
·我长成这样是为了让人看起来更想拥抱。<br>\
·如果你生气了，就欺负我好了，反正我那么喜欢你。<br>\
·相信我，就算有一天，我们不小心走散，我也会回来找你的。<br>\
·为了你，我什么都会去做。只是有时候我笨手笨脚的，能不能不要怪我呢。<br>\
<br>\
<br>\
15、西西里的美丽传说<br>\
<br>\
美丽无罪。<br>\
她，撩著波浪状黑亮的秀发，穿著最时髦的短裙和丝袜，踏著充满情欲诱惑的高跟鞋，来到了西西里岛上宁静的阳光小镇。她的一举一动都引人瞩目、勾人遐想，她的一颦一笑都教男人心醉、女人羡妒。玛莲娜，像个女神一般，征服了这个海滨的天堂乐园。 <br>\
<br>\
<br>\
16、神偷奶爸<br>\
<br>\
·你装过头了 其实内在是一颗破碎的心。<br>\
·蹩脚的谎话 我甚至都不喜欢她<br>\
·Are you reallyabcgonna save the world? 你真的要拯救世界吗? Yes. Yes, I am. 是的是的 没错<br>\
·You just officially hadabcthe worst date ever. 你圆满完成了史上最糟糕约会<br>\
<br>\
<br>\
17、驯龙高手<br>\
<br>\
·我知道这希望渺茫，但是你不能总是保护他。<br>\
·哦，上帝不喜欢我。有些人会弄丢刀子，杯子。不，不应该是我啊！我弄丢了一条龙！<br>\
·我父亲让我用头去撞石头，我照做了。我觉得这很疯狂，但是我没问他为什么。<br>\
·不，你想错了，他在乎的不是你的外表，他看重的是你的灵魂。<br>\
<br>\
<br>\
18、布达佩斯大饭店<br>\
<br>\
故事要从一位无名作家（裘德·洛 Jude Law 饰）说起，为了专心创作，他来到了名为“布达佩斯”的饭店，在这里，作家遇见了饭店的主人穆斯塔法（F·莫里·亚伯拉罕 F. Murray Abraham 饰），穆斯塔法邀请作家共进晚餐，席间，他向作家讲述了这座饱经风雨的大饭店的前世今生。 <br>\
<br>\
<br>\
19、老男孩猛龙过江<br>\
<br>\
·成长似乎就是不断发现，那些让自己魂牵梦绕的东西，原来都是一场场幻想，然后一次次从梦里醒过来，而现实从来连一点商量的余地都没有。<br>\
·如果你的梦想还没有实现,说明你的渴望还不够强烈!<br>\
·丢掉什么不重要，关键是找回来什么。<br>\
·生活就像镜子 你笑它就笑 你哭它就哭。<br>\
·分手还能做朋友,你问我爱你有多深。<br>\
<br>\
<br>\
20、当幸福来敲门<br>\
<br>\
·当人们做不到一些事情的时候，他们就会对你说你也同样不能。<br>\
·如果你有梦想的话，就要去捍卫它。<br>\
·当你最认为困难的时候，其实就是你最接近成功的时候。<br>\
·以后连朋友都不做了？ ---没法儿做，太相爱的人怎么做朋友<br>\
·机会总是留给有准备的人，但那往往是努力的人剩下来的。<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    //console.log(c[0].replace('、', ' ') + '.jpg');
};